#include <iostream>
using namespace std;

/*
右移 >>
正数：x>>y = x / (2^y) 
负数（有符号int）：算术右移，左边**补符号位1**
*/

int main()
{
    //1.正数右移
    int a = 0b111; //7
    a = (a >> 1);
    cout << a << endl; 

    //2.负数右移，算术右移，高位补1
    int b = -1;
    cout << (b >> 1) << endl; //仍然输出 -1
    // 11111111 11111111 11111111 11111111 = -1
    // 111111111 11111111 11111111 1111111 = -1

    //3.去掉低k位：把低位k个二进制直接挤出去
    int c = 0b10000101;
    cout << (c >> 7) << endl;

    //4.取出第k位：先右移k位，再 &1，单独拿到这一位是0还是1
    int d = 0b101010101;
    cout << ((d >> 4) & 1) << endl;

    return 0;
}

